# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'
brew 'moreutils'
brew 'findutils'

# Dev
brew 'python'
brew 'ruby'
brew 'node'
#brew 'python3'
brew 'flake8'

# Install Binaries
brew 'wget'
brew 'git'
brew 'vim'
brew 'tmux'
brew 'hub'
brew 'tree'
#brew 'macvim', args: ['with-override-system-vim', 'with-python3', 'with-lua', 'env-std']
#brew 'mackup'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'antigen'

# Apps
cask 'iterm2', args: ['force']
cask 'atom', args: ['force']
cask 'dropbox', args: ['force']
cask 'firefox', args: ['force']
cask 'google-chrome', args: ['force']
cask 'google-drive', args: ['force']
cask 'handbrake', args: ['force']
cask 'spotify', args: ['force']
cask 'transmission', args: ['force']
cask 'vlc', args: ['force']
cask 'teamviewer', args: ['force']

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'
cask 'qlprettypatch'
cask 'betterzipql'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'

# Fonts
cask 'font-roboto-mono'
cask 'font-roboto-mono-for-powerline'

