# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'
brew 'moreutils'
brew 'findutils'

# Dev
brew 'python'
brew 'python3'
brew 'ruby'
brew 'node'
brew 'flake8'

# Install Binaries
brew 'wget'
brew 'git'
brew 'vim'
brew 'tmux'
brew 'hub'
brew 'tree'
#brew 'mackup'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'antigen'

# Apps
cask iterm2 --force
cask atom --force
cask dropbox --force
cask firefox --force
cask google-chrome --force
cask google-drive --force
cask handbrake --force
cask spotify --force
cask transmission --force
cask vlc --force
cask teamviewer --force

# Fonts
cask 'font-roboto-mono'
cask 'font-roboto-mono-for-powerline'

