# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'
brew 'moreutils'
brew 'findutils'

# Dev
brew 'node'
brew 'rbenv'
brew 'ruby-build'
brew 'python'
brew 'python3'

# Install Binaries
brew 'wget'
brew 'git'
brew 'macvim', args: ['with-override-system-vim', 'with-python3', 'with-lua', 'env-std']
brew 'tmux'
brew 'hub'
brew 'tree'
#brew 'mackup'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'antigen'

# Apps
cask 'iterm2'
cask 'atom'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'google-drive'
cask 'handbrake'
cask 'spotify'
cask 'transmission'
cask 'vlc'
cask 'teamviewer'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'
cask 'qlprettypatch'
cask 'betterzipql'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'

# Fonts
cask 'font-roboto-mono'
cask 'font-roboto-mono-for-powerline'

