cask_args appdir: '/Applications'

# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'
brew 'moreutils'
brew 'findutils'

# Dev
#brew 'python3'
#brew 'ruby'
#brew 'node'
#brew 'yarn'

# Install Binaries
brew 'zsh'
brew 'git'
brew 'vim'
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'mackup'
brew 'mas'

# Apps
cask 'iterm2'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'google-drive'
cask 'handbrake'
cask 'transmission'
cask 'vlc'
cask 'teamviewer'
#cask '

# Fonts
cask 'font-sourcecodepro-nerd-font'
cask 'font-sourcecodepro-nerd-font-mono'

