cask_args appdir: '/Applications'

# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'
brew 'moreutils'
brew 'findutils'

# Dev
#brew 'python3'
#brew 'ruby'
#brew 'node'
#brew 'yarn'

# Install Binaries
brew 'zsh'
brew 'antigen'
brew 'git'
brew 'vim'
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'mackup'
brew 'mas'
brew 'openssh'

# Apps
#cask 'google-chrome'
#cask 'firefox'
#cask 'dropbox'
#cask 'google-drive'
#cask 'iterm2'
#cask 'transmission'
#cask 'teamviewer'
#cask 'diskmaker-x'
#cask 'etcher'
#cask 'vlc'
#cask 'handbrake'

# Fonts
cask 'font-sourcecodepro-nerd-font'
cask 'font-sourcecodepro-nerd-font-mono'

