# Taps
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# Basic apps
brew "vim"
brew "git"
brew "wget"
brew "curl"
brew "zsh"

# GNU core utilities (those that come with macOS are outdated)
brew "coreutils"
brew "moreutils"
brew "findutils"

# Frameworks
brew "python"
#brew "ruby"
#brew "node"
#brew "yarn"

# Other tools
brew "openssh"
brew "tmux"
brew "tree"
brew "mackup"
brew "mas"

# Apps not on Mac App Store
cask "docker"
#cask "dropbox"
cask "firefox"
cask "forklift"
cask "google-chat"
cask "google-chrome"
cask "handbrake"
cask "iterm2"
cask "skype"
cask "spectacle"
cask "spotify"
cask "teamviewer"
#cask "tor-browser"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "vmware-fusion"

# Apps from Mac App Store
mas "BBEdit", id: 404009241
mas "Fantastical", id: 975937182
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Mactracker", id: 430255202
mas "MeisterTask", id: 1051767777
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "MindNode", id: 1289197285
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Spark", id: 1176895641
mas "Sweet Home 3D", id: 669289700
mas "The Unarchiver", id: 425424353
mas "WhatsApp", id: 1147396723
mas "WiFi Explorer", id: 494803304
#mas "Xcode", id: 497799835

# Fonts
cask "font-meslo-lg"
cask "font-meslo-nerd-font"
cask "font-meslo-nerd-font-mono"
