cask_args appdir: '/Applications'

# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'
brew 'moreutils'
brew 'findutils'

# Dev
brew 'python'
brew 'ruby'
#brew 'node'
#brew 'yarn'

# Install Binaries
brew 'vim'
brew 'git'
brew 'tmux'
brew 'zsh'
brew 'antigen'
brew 'tree'
brew 'wget'
brew 'mackup'
brew 'mas'
brew 'openssh'

# Fonts
cask 'font-meslo-lg'
cask 'font-meslo-nerd-font'
cask 'font-meslo-nerd-font-mono'
