# Basic apps
brew "bat"
brew "btop"
brew "chezmoi"
brew "curl"
brew "eza"
brew "git"
brew "git-delta"
brew "starship"
brew "vim"
brew "wget"
brew "zsh"

# GNU core utilities (those that come with macOS are outdated)
brew "coreutils"
brew "findutils"
brew "moreutils"

# LazyGit
brew "fd"
brew "fzf"
brew "lazygit"
brew "neovim"
brew "ripgrep"
brew "tree-sitter-cli"

# Apps not on Mac App Store
cask "1password"
cask "1password-cli"
cask "brave-browser"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "kitty"
cask "logi-options-plus"
cask "moom"
cask "tor-browser"
cask "visual-studio-code"
cask "whatsapp"
